app/controllers/posts_controller.rb

    def show #this is the action show
        @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]